In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({
    'name': ['alice','bob','charlie','daniel'],
    'age': [2,15,30,70]
})
df

      name  age
0    alice    2
1      bob   15
2  charlie   30
3   daniel   70

In [3]:
df.assign(
    age_cat = lambda x : x.age.map(lambda x : 'Young' if x < 30 else 'Old')
)

      name  age age_cat
0    alice    2   Young
1      bob   15   Young
2  charlie   30     Old
3   daniel   70     Old

In [43]:
df = pd.DataFrame({
    'make': ['audi','audi','mercedes','toyota', 'honda'],
    'price': [200,200,3000,70000,5000]
})
df

       make  price
0      audi    200
1      audi    200
2  mercedes   3000
3    toyota  70000
4     honda   5000

In [44]:
german_list = ['audi', 'mercedes', 'bmw', ]
japan_list = ['toyota', 'honda', 'mazda']

conditions = [ 
    (df.make.isin(german_list)),
    (df.make.isin(japan_list)),
]

values = ['German', 'Japan']

df['make_country'] = np.select(conditions, values)
df

       make  price make_country
0      audi    200       German
1      audi    200       German
2  mercedes   3000       German
3    toyota  70000        Japan
4     honda   5000        Japan

In [45]:
German = ['audi', 'mercedes', 'bmw']
df.loc[df.make.isin(German),  'country'] = 'German'

In [14]:
LL00 = [German, Japan ]
L01 = ['German', 'Japan']

for i, j in (LL00, L01):
    print('i', i)
    print('j', j)

i ['audi', 'mercedes', 'bmw']
j ['toyota', 'honda']
i German
j Japan

In [23]:
df.loc[[0,3], 'price'] = 299
df

       make  price make_country
0      audi    299       German
1       bmw  15000       German
2  mercedes   3000       German
3    toyota    299        Japan
4     honda   5000        Japan

In [21]:
df.loc[0, 'price']

200

In [56]:
df

       make  price make_country country
0      audi    200       German  German
1      audi    200       German  German
2  mercedes   3000       German  German
3    toyota  70000        Japan     NaN
4     honda   5000        Japan     NaN

In [47]:
df.duplicated()

0    False
1     True
2    False
3    False
4    False
dtype: bool

In [51]:
df.duplicated(keep= 'last')

0     True
1    False
2    False
3    False
4    False
dtype: bool

In [52]:
df.duplicated(keep= 'first')

0    False
1     True
2    False
3    False
4    False
dtype: bool

In [55]:
df.duplicated(keep= False)

0     True
1     True
2    False
3    False
4    False
dtype: bool

In [59]:
df.duplicated(subset=['make', 'country'], keep= False)

0     True
1     True
2    False
3    False
4    False
dtype: bool

In [60]:
df

       make  price make_country country
0      audi    200       German  German
1      audi    200       German  German
2  mercedes   3000       German  German
3    toyota  70000        Japan     NaN
4     honda   5000        Japan     NaN

In [62]:
df.drop_duplicates()

       make  price make_country country
0      audi    200       German  German
2  mercedes   3000       German  German
3    toyota  70000        Japan     NaN
4     honda   5000        Japan     NaN